{
    "projects": [
        {
            "id": 1,
            "title": "Mathogen: An Educational Game for Math training",
            "description": "Mathogen is an educational game designed to make math engaging and rewarding. Inspired by Tetris, it transforms problem-solving into an endless challenge that enriches players' skills.",
            "fullContent": {
              "overview": "I've always loved video games, but I wanted to create something that not only entertained but also provided lasting value. That's how Mathogen was born—an educational game centered around math, the universal language. It draws inspiration from Tetris, where mistakes shape the experience, and every session leaves players feeling accomplished rather than empty-handed.",
              "features": [
                "Engaging math-based gameplay with infinite challenge",
                "Collectible cards mechanic to keep players engaged",
                "Made with C# in Unity and adapted for multiple platforms",
                "Designed to be an endless runner experience, rewarding accuracy over speed",
                "Integrated with analytics to track player engagement and improve performance"
              ],
              "technologies": [
                "Objective-C using the Cocos2d-x Engine for initial iOS development",
                "C# for Unity Development and exported to iOS",
                "Google Admob for monetization"
              ],
              "challenges": "During development, I encountered multiple challenges: submission hurdles with Apple, unexpected crash reports from early users, and the need to adapt the game across different platforms. Transitioning from a timer-based model to an endless runner format also required careful design adjustments.",
              "outcome": "Mathogen has gone through multiple iterations and continues to evolve. By removing the timer constraint and focusing on accuracy, I aim to create a game that players can enjoy endlessly while sharpening their math skills. The project has also connected me with a wider programming community, leading to opportunities in tutoring and game development."
            },
            "tags": ["Unity", "C#", "Educational Game", "Math", "iOS Development"],
            "liveUrl": "https://apps.apple.com/us/app/mathogen/id323507276",
            "image": "/images/Mathogen_icon.png"
        },
        {
            "id": 2,
            "title": "Bible Scripture Word Match",
            "description": "An engaging mobile game that helps users memorize and reinforce Bible verses by filling in missing words. Designed for iPad and iPhone, it offers an ad-free experience with no internet required.",
            "fullContent": {
              "overview": "Bible Scripture Word Match is a faith-based word game that encourages users to deepen their understanding of the Bible. The game presents scripture passages with missing words, and players must select the correct word to complete the verse. With topics like love, faith, friendship, and forgiveness, this app is designed to inspire and educate.",
              "features": [
                "Fill-in-the-blank scripture puzzles",
                "Levels focused on key biblical themes",
                "No internet required for offline play"
              ],
              "technologies": [
                "C# for Unity Development and exported to iOS",
                "Google Admob for monetization"
              ],
              "challenges": "One challenge was designing a user-friendly interface that appeals to all age groups while ensuring a smooth offline experience. We optimized local data storage and refined the game flow to provide an enjoyable and educational gameplay experience.",
              "outcome": "Bible Scripture Word Match has been well-received by users looking for a meaningful and engaging way to memorize scripture. The app maintains a positive rating and continues to attract new players through its simple yet effective gameplay."
            },
            "tags": ["Unity", "C#", "Bible", "Educational Game"],
            "liveUrl": "https://apps.apple.com/us/app/bible-scripture-word-match/id6462538578",
            "image": "/images/BSWM_icon.png"
        },
        {
            "id": 3,
            "title": "Bible Scripture Typing Daily",
            "description": "A fun and educational macOS app that helps users improve their typing speed while memorizing Bible verses. Designed for all ages, it works offline and allows users to add custom verses.",
            "fullContent": {
              "overview": "Type the Truth is a unique typing practice app that combines scripture memorization with keyboarding skills. Originally created for the son of an assistant pastor who was learning to type, this app has since become a favorite among users looking to strengthen both their faith and typing abilities.",
              "features": [
                "Includes over 100 Bible verses",
                "Allows users to add custom Bible verses",
                "Works without an internet connection",
                "Tracks typing speed and accuracy",
                "Encouraging feedback and scripture-based motivation"
              ],
              "technologies": [
                "Swift for macOS development",
                "CoreData for local storage of custom verses",
                "Apple's GameKit for progress tracking"
              ],
              "challenges": "One challenge was ensuring a smooth and responsive typing experience while keeping the app lightweight and offline-friendly. Optimizing text rendering and input processing was key to delivering an engaging user experience.",
              "outcome": "Bible Scripture Typing Daily has received a 4.7-star rating on the Mac App Store, with users praising its simplicity and effectiveness. It has helped many users improve their typing skills while deepening their knowledge of scripture."
            },
            "tags": ["macOS", "Swift", "Bible", "Typing Game"],
            "liveUrl": "https://apps.apple.com/us/app/bible-scripture-typing-daily/id1484895431?mt=12",
            "image": "/images/BSTD_icon.png"
        },
        {
            "id": 4,
            "title": "Are You Local?",
            "description": "A fun and engaging trivia game that tests how local you are to Hawaii! Answer questions about local culture, food, and history to see where you rank.",
            "fullContent": {
              "overview": "Hawaii Local Quiz is an entertaining mobile app that challenges users with trivia questions about Hawaii's unique culture, history, and lifestyle. Players answer multiple-choice questions and receive a 'local' ranking based on their score. The app is designed for both locals and visitors who want to test their knowledge and learn more about Hawaii.",
              "features": [
                "Hundreds of Hawaii-themed trivia questions",
                "Engaging multiple-choice format",
                "Local ranking system based on quiz performance",
                "Works offline for on-the-go fun",
                "Available on both iOS and Android"
              ],
              "technologies": [
                "Unity for cross-platform game development",
                "C# for game logic and interactions",
                "Google Admob for monetization",
                "Designed for both iOS and Android"
              ],
              "challenges": "Balancing the difficulty level of the questions while keeping the game fun and informative was a challenge. We refined the quiz content through user feedback to ensure a rewarding experience for both locals and newcomers.",
              "outcome": "Hawaii Local Quiz has received positive reviews for its entertaining and educational gameplay. It has been popular among locals and visitors alike, making learning about Hawaii fun and interactive."
            },
            "tags": ["Unity", "C#", "Trivia Game", "Hawaii"],
            "liveUrl": "https://apps.apple.com/us/app/are-you-local/id6466523161",
            "image": "/images/AYL_icon.png"
        },
        {
          "id": 5,
          "title": "Dad Jokes Watch App",
          "description": "Turn your Apple Watch into the ultimate dad joke machine and create daily moments of laughter your kids will actually ask for.",
          "fullContent": {
            "overview": "Dad Joke Daily is a fun and heartwarming Apple Watch app that delivers a fresh, hilarious dad joke to your wrist every single day. Designed to spark laughter and connection, this app transforms ordinary moments—breakfast, school runs, bedtime—into memorable family traditions. Instead of reaching for screens, kids will run to you asking, 'What's today’s joke, Dad?'",
            "features": [
              "Daily dad joke delivered right to your Apple Watch",
              "Simple glance-and-go design for quick delivery",
              "Perfect conversation starter at any time of day",
              "Build lasting memories and family traditions",
              "Zero effort, maximum laughs"
            ],
            "technologies": [
              "Swift for Apple Watch development",
              "WatchKit for seamless watchOS integration",
              "Optimized for quick-glance complications",
              "Available exclusively for Apple Watch"
            ],
            "challenges": "The biggest challenge was balancing joke quality with simplicity. We curated the perfect set of jokes to ensure they’re funny, family-friendly, and quick to deliver in just a glance.",
            "outcome": "Dad Joke Daily has become a favorite for parents who want to connect with their kids through humor. Thousands of families now share a daily laugh, proving that the best parenting tool can sometimes be a perfectly timed pun."
          },
          "tags": ["watchOS", "Swift", "Dad Jokes", "Parenting", "Humor"],
          "liveUrl": "https://apps.apple.com/us/app/dad-jokes-watch-app/id6749955835",
          "image": "/images/DadJokes_icon.png"
        },
        {
          "id": 6,
          "title": "Affirmations Watch App",
          "description": "A focused, dad-centered affirmations app for Apple Watch that helps Dads in their 30s and 40s stay grounded, patient, confident, and intentional—right from their wrist.",
          "fullContent": {
            "overview": "Affirmations Watch App is a mindful, purpose-driven experience designed specifically for Dads who juggle work, family, and personal growth. It delivers powerful, dad-focused affirmations throughout the day to help you stay calm during stress, reconnect with your purpose, and show up as the father and leader you strive to be. Whether you need patience during a tough parenting moment, confidence before a big meeting, or a reminder of the dad you're becoming—this app keeps you centered, right from your wrist.",
            "features": [
              "Dad-focused affirmation categories across fatherhood, patience, leadership, marriage, confidence, and more",
              "Add your own custom affirmations tailored to your goals and family values",
              "Ultra-simple watchOS experience designed for quick mental resets",
              "Favorites and quick-access tools for moments when you need encouragement fast",
              "Daily Dad Mode—set a mindset theme like Patience, Gratitude, or Leadership"
            ],
            "technologies": [
              "Swift for native watchOS development",
              "WatchKit for fast and seamless Apple Watch UI",
              "Optimized for quick-glance interactions and minimal distraction"
            ],
            "challenges": "The main challenge was designing an experience that supports emotional wellbeing without overwhelming the user. The interface needed to be distraction-free while still offering depth, personalization, and powerful content that resonates specifically with modern fathers.",
            "outcome": "Affirmations Watch App provides Dads with a reliable, uplifting tool they can use throughout their day to stay grounded and intentional. Early testers report feeling calmer during stressful moments, more connected to their identity as fathers, and more aligned with the habits and mindset they want to model for their families."
          },
          "tags": ["watchOS", "Swift", "Affirmations", "Parenting", "Mindfulness", "Wellbeing"],
          "liveUrl": "",
          "image": "/images/appIconAffirmations.png"
        }

        
    ]
}