{
    "posts": [
      {
        "id": 1,
        "title": "Project Updates: Slomo, Inflight Entertainment App, and Bookmark Manager",
        "date": "April 2, 2025",
        "description": "A progress update on the Slomo music slowdown app, plans for launching an inflight entertainment app, and the technology stack decision for our bookmark manager project.",
        "tags": ["SwiftUI", "MacOS", "Laravel", "React", "App Development"],
        "fullContent": {
          "introduction": "This week, we made significant progress on several projects, including our Slomo app, a potential inflight entertainment app, and a new bookmark manager project. Here’s a breakdown of what we discussed and our next steps.",
          "sections": [
            {
              "title": "Slomo: A MacOS Music Slowdown App",
              "content": "We had a productive meeting with Adam regarding Slomo, our MacOS music slowdown app built with Catalyst and SwiftUI. We've identified a few bugs: (1) The waveform does not resize properly when resizing the window, and (2) There's an issue with retrieving MP3 files from the bundle due to permission errors when restarting the app. Additionally, using Cursor AI's Auto model selection has caused errors: one where Cursor fails to recognize an existing class file and another where the Swift linter introduces issues that Cursor keeps iterating on unnecessarily. Adam will investigate these bugs this week."
            },
            {
              "title": "Inflight Entertainment App: A New Launch Strategy",
              "content": "We revisited an app we developed last year, originally pitched to local airline companies for inflight entertainment. Since those partnerships didn’t work out, we’re considering launching it ourselves on the iOS App Store for free with Google Ads. I plan to experiment with TikTok marketing to drive organic interest. This will also give me an opportunity to log into my Google AdSense account and check on an issue affecting ads in my other game, Mathogen."
            },
            {
              "title": "Bookmark Manager App: Choosing the Right Stack",
              "content": "Instead of jumping into coding with Cursor, we took a step back to research the best stack for our bookmark manager project. After evaluating our options, we decided on Laravel for the backend and React for the frontend. This week, I'll be looking into hosting solutions, and Adam and I will check in next week to finalize details and plan our next steps."
            }
          ],
          "conclusion": "We’ve made great strides in debugging Slomo, pivoting our inflight entertainment app strategy, and finalizing the tech stack for our bookmark manager. Next week, we’ll continue refining these projects and making key implementation decisions. Stay tuned for more updates!"
        }
      },
      {
        "id": 2,
        "title": "Building Better Word Search Puzzles with Code",
        "date": "April 4, 2025",
        "description": "How I used automation, SVGs, and a bit of creative thinking to improve the quality of my digital word search puzzle products.",
        "tags": ["Python", "SVG", "Automation", "Small Business", "Cursor"],
        "fullContent": {
          "introduction": "As someone who's been building apps and websites for over 15 years, I love applying those skills to personal creative projects. One of my favorites is a small digital shop where I sell word search puzzle books. It’s fun, rewarding, and—like any product venture—full of opportunities to grow when users share feedback.",
          "sections": [
            {
              "title": "Turning Criticism Into Improvement",
              "content": "Recently, a customer left a review pointing out a duplicated word in one of my puzzles. That kind of feedback can sting, but I see it as a gift. I opened up Cursor and loaded the Python script I use to generate the puzzles. Using the Claude Sonnet 3.7 model, I updated the logic to filter out duplicates and sort the word list alphabetically. A small change, but it ensures a smoother experience for future customers—and shows them I care about the details."
            },
            {
              "title": "Answer Keys Without the Manual Labor",
              "content": "Another customer suggested including answer keys at the back of the book. Great idea—but solving every puzzle by hand wasn’t scalable. I spent a while stuck, unsure how to programmatically highlight the solution words in a clear and scalable way. Then, during a chat with my friend Adam (who needed a logo), I mentioned I’d been generating SVGs for icons using Cursor. That idea stuck with me: what if I rendered the answer keys as SVGs?"
            },
            {
              "title": "The SVG Solution",
              "content": "SVGs turned out to be the perfect format. They scale well, print cleanly, and allow for flexible layouts. I spent about 90 minutes working with Cursor to refine the rendering: early attempts either circled every letter or drew unreadable lines through diagonals. Eventually, I got the styling right—but I hit another problem. Overlapping highlights obscured shared letters, which made the solution unreadable. So I updated the generation logic to intelligently layer highlights without sacrificing clarity."
            },
            {
              "title": "Overlapping Letters and Layout Challenges",
              "content": "I also realized the puzzles weren’t overlapping words at all—each letter was used by only one word. That’s not how real puzzles work! I tweaked the code to allow for shared letters and better word placement. It felt like a small but meaningful win: not just fixing the issue, but improving the product. And now, with SVGs for both puzzles and solutions, everything looks better and is easier to manage."
            },
            {
              "title": "Next Steps: Automating the Layout",
              "content": "My next goal is to automate the layout further. I want to generate an SVG that includes the puzzle number, the word search grid, and a two-column list of hidden words—all in one go. That way, I can ditch the clunky Pages mail merge and use a clean CSV-to-SVG pipeline instead. With just three columns—puzzle, solution, and metadata—I’ll be able to produce hundreds of pages with consistent, beautiful formatting."
            }
          ],
          "conclusion": "This project has reminded me how much joy there is in solving problems—not just for myself, but for the people who use my work. Whether it's refining an old Python script or designing better UX through automation, I approach every project with care, curiosity, and an eye for detail. If you’re looking for someone to help build thoughtful, well-engineered digital products, I’d love to collaborate."
        }
      },
      {
        "id": 3,
        "title": "Streamlining Puzzle Delivery: SVGs, PDFs, and Automation",
        "date": "April 8, 2025",
        "description": "How I automated the creation of puzzle books and solutions for my Etsy shop using Python and Cursor AI.",
        "tags": ["Python", "SVG", "Automation", "Etsy", "Digital Products"],
        "fullContent": {
          "introduction": "After a refreshing weekend away in Ireland, I was eager to dive back into my work. One of the projects I’d been planning was to improve the way I deliver my word search puzzles and solutions to customers. I had the vision and the tools ready, and I knew exactly what I wanted to achieve.",
          "sections": [
            {
              "title": "Automating Puzzle Creation",
              "content": "I started with an SVG file containing both the puzzle grid and the answer key. My goal was to programmatically add the hidden words and the puzzle ID to each SVG, and then export those completed files in bulk. I set up a Python script to handle it, which was surprisingly smooth thanks to the help of Cursor AI. With just a few tweaks, I managed to export 1,000 SVGs to a folder—exactly what I needed to streamline the process."
            },
            {
              "title": "Overcoming Limitations with Mac Pages",
              "content": "Initially, I thought about using Mac Pages for a mail merge, but I quickly hit a wall with its limitations—particularly when it came to handling images in bulk. Rather than let that slow me down, I decided to tackle it head-on. I used Cursor AI to write a Python script that would merge the SVGs into a single PDF file. This worked perfectly for both the puzzles and the solutions, and the automation saved me hours of manual work."
            },
            {
              "title": "Seamlessly Updating My Etsy Shop",
              "content": "With the PDFs created, the next step was to update my Etsy shop. I uploaded the completed puzzle PDFs and solution PDFs to Google Drive and updated the links for each product. This ensured that customers could easily download the files once they purchased them. The entire process, from creating the PDFs to updating my Etsy listings, took just two hours—efficiency at its finest."
            },
            {
              "title": "Taking a Break and Gaining Perspective",
              "content": "After a productive couple of hours, I took a 30-minute break to watch 'Love on the Spectrum' season three. Sometimes, a short break is all it takes to refresh your mind and come back with even more creative ideas. It's a reminder that balance and downtime are just as important as hard work."
            }
          ],
          "conclusion": "The entire process went off without a hitch, thanks to automation and a bit of problem-solving along the way. Whether it's tackling challenges with Python, exploring new tools like Cursor AI, or updating my shop to improve the customer experience, I always strive to work efficiently and with attention to detail. If you’re looking for someone to help build and optimize digital products—whether through automation or creative problem-solving—I'd love to help bring your ideas to life."
        }
      },
      {
        "id": 4,
        "title": "Progress, Pivots, and Planning Ahead",
        "date": "April 10, 2025",
        "description": "A behind-the-scenes look at the current projects I'm building, the small hurdles along the way, and how I'm thinking about what's next.",
        "tags": ["Web Development", "App Development", "Teamwork", "Freelance"],
        "fullContent": {
          "introduction": "Some weeks are about big wins. Others are about progress, persistence, and the small steps that move a project forward. This week’s update is more of the latter — full of little lessons, technical tweaks, and forward motion in a few different areas. I had another great check-in with my longtime collaborator Adam, and we covered a lot of ground.",
          "sections": [
            {
              "title": "App Store Hurdles & Plans for Growth",
              "content": "I recently submitted *How Local* to the iOS App Store — always a great milestone, but this time it came with a bump. Apple rejected it because the current screenshots didn’t reflect the latest version of the app. Totally fair. I’ll be updating the visuals and resubmitting soon. \n\nOnce it's live, I'm planning to integrate a bottom banner for ads to start testing monetization. I also want to experiment with short-form video content — TikTok, Instagram, and YouTube Shorts — to try and generate some organic traction. These kinds of small bets are exciting, especially when you have a product you believe in."
            },
            {
              "title": "Hosting Decisions and Tech Stack Trade-offs",
              "content": "Adam and I dug into hosting for one of our Laravel + React projects. Originally, we hoped to run it on our shared hosting plan, but after some digging, Adam found that Node.js is going to be necessary — something the shared host doesn’t support. \n\nHe’s now looking into other options. DigitalOcean looks like a solid pick at $4/month. It’s a minor pivot, but one that will give us a lot more flexibility as we continue development."
            },
            {
              "title": "Collaboration and Design Tweaks",
              "content": "One of the best parts of working with Adam is how naturally we’ve developed a rhythm around version control, design updates, and feedback. He recently resolved a GitHub hiccup and is finalizing a new push with updated code. Once that’s in, I’ll be updating the color scheme based on our latest design direction.\n\nHe also created new buttons using SVGs with Cursor, which I’m really looking forward to seeing. Small things like icons can really shape the feel of a product, and I appreciate that we both take pride in those details."
            },
            {
              "title": "Looking Ahead: Categorization with AI",
              "content": "Our next project is starting to take shape — and one of the big technical challenges will be categorizing a large collection of data in a way that feels intuitive and smart. I don’t have a fully fleshed-out architecture yet, but that’s part of the fun.\n\nWe’re planning to leverage AI in the workflow, especially for tagging and search. Maybe we’ll even experiment with location-aware features. One big lesson from our past attempts: we’re going to be more intentional this time about how AI generates code. Specifically, we’ll make sure it sticks to a markdown file structure we define upfront. That kind of structure saves a lot of cleanup later on."
            }
          ],
          "conclusion": "This kind of week is a reminder that building digital products isn’t just about code — it’s about communication, curiosity, and iteration. I love that I get to work with thoughtful collaborators, push through the little snags, and think creatively about what’s possible. If you’re looking for someone who brings both experience and excitement to a project — let’s talk."
        }
      },
      {
        "id": 5,
        "title": "What I’ve Been Working On: Local Vibes, App Store Prep, and a Little Sudoku",
        "date": "April 12, 2025",
        "description": "A behind-the-scenes look at this week’s projects: improving a local trivia app, polishing UI details, and getting ready to launch a new Sudoku experience.",
        "tags": ["Unity", "iOS", "App Development", "Indie Dev", "Soft Skills"],
        "fullContent": {
          "introduction": "One of my favorite things about building digital products is watching them go from idea to polished experience. This past week, I’ve been elbows-deep in code, design tweaks, and the kind of tiny UI details that make a big difference in the long run. Here’s a quick snapshot of what I’ve been up to.",
          "sections": [
            {
              "title": "Fixing Bugs, Clarifying Rewards",
              "content": "I kicked things off by fixing a tricky issue with Google AdMob that was preventing ads from displaying. It wasn’t glamorous work, but it’s the kind of thing that matters when you want a polished, professional product.\n\nAfter that, I fine-tuned the wording in the treasure chest reward box. Players weren’t always clear on what they were getting, so I rewrote the message to say clearly that prizes are random. I also added the exact odds of getting each prize—especially the coveted mathematician cards. It’s a small tweak, but it builds trust with players."
            },
            {
              "title": "Are You Local? Gets a Fresh Look",
              "content": "Next up, I gave a little extra love to *Are You Local?*, a trivia app celebrating Hawaii's local culture. I added a fun new splash screen featuring a cartoon-style uncle and aunty, both characters I created using ChatGPT’s image tools. It’s colorful, warm, and instantly gives the app a cozy, local vibe.\n\nOnce the visuals were ready, I exported the app from Unity and ran it in the iPhone XS Max simulator to capture the required 6.5-inch screenshots for the App Store. I also tested it on a 13-inch iPad to grab the larger screenshots. Everything is now submitted to Apple and waiting for review!"
            },
            {
              "title": "What’s Next: TikTok, Sudoku, and New Grids",
              "content": "While I wait on Apple’s green light, I’ve already got plans for the next steps. I’m going to create a TikTok campaign to generate organic buzz for *Are You Local?* I’ve brainstormed a few video ideas that blend humor and heart—because the app is all about community.\n\nOn the side, I’ve also started working on a new grid layout using Cursor to build out a visual for my Samurai Sudoku puzzle. I’ve already created the number sets, and I’m planning to release it on my store later this week.\n\nIt’s all coming together piece by piece."
            }
          ],
          "conclusion": "This week has been a reminder that good software is made in the details—clear communication, thoughtful UX, and persistence through the technical stuff that no one sees. I care deeply about the products I work on and the people who use them. If you're looking for someone who brings heart, humor, and a ton of hands-on experience to your next digital project, let’s talk."
        }
      }
      
      
      
    ]
  }